# Quiz 1 : a 리스트에서 "yusom"이라는 문자열을 가져오슈
a = [1, 2, [3, 4, ["hello", "yusom"]]]


# Quiz 2 : a 리스트에서 인덱스의 번호가 홀수인 값을 슬라이싱으로 가져오고 출력하기
# 2 가지의 방법을 작성해보아요~
a = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]


# Quiz 3 : a 리스트를 오름차순으로 정렬하고 역순으로 정렬해보슈
a = [3, 6, 1, 10, 2, 7]


# Quiz 4 : 3번 퀴즈에서 바뀐 a 리스트의 가운데 인덱스에 원소 100을 추가 해보슈


# Quiz 5 : a 딕셔너리에 key : '1', value : 1 을 추가해 보아요~
a = {1: 1, 2: 2}


# Quiz 6 : a 딕셔너리의 모든 key값, value값, (key, value)를 출력 해보거라


# Quiz 7 : 각 연산의 결과를 구하고 설명하거라
print(bool([])) 	# 답 : # 설명
print(bool(1))		# 답 : # 설명
print(bool(2))		# 답 : # 설명
print(bool(""))		# 답 : # 설명

